/* Напишите программу, которая принимает на
вход трёхзначное число и на выходе показывает вторую
цифру этого числа.
456 -> 5
782 -> 8
918 -> 1 */

/* int N = 918;
Console.WriteLine(N);

int c1 = N / 100;
int c2 = N % 10;
int c3 = (N / 10) % 10;
Console.WriteLine(c3); */

/* Напишите программу, которая принимает на
вход цифру, обозначающую день недели, и проверяет,
является ли этот день выходным.
6 -> да
7 -> да
1 -> нет */

/* int a = 16;

if (a <= 7)
{
   if (a > 5)
{
    Console.WriteLine("Выходной день");
}
else
{
    Console.WriteLine("Будный день");
} 
}
else
{
    Console.WriteLine("Это число не является днем недели");
} */
